In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import seaborn as sns
from matplotlib import pyplot as plt

In [3]:
col = ['User ID','Gender','Age','EstimatedSalary','Purchased']
hello=pd.read_csv('Social_Network_Ads.csv',names=col,header=1)
hello['Sex']=np.where(hello['Gender']!='Male',0,1)
hello.head()

    User ID  Gender  Age  EstimatedSalary  Purchased  Sex
0  15810944    Male   35            20000          0    1
1  15668575  Female   26            43000          0    0
2  15603246  Female   27            57000          0    0
3  15804002    Male   19            76000          0    1
4  15728773    Male   27            58000          0    1

In [4]:
hello.describe()

            User ID         Age  EstimatedSalary   Purchased         Sex
count  3.990000e+02  399.000000       399.000000  399.000000  399.000000
mean   1.569171e+07   37.701754     69869.674185    0.358396    0.488722
std    7.166938e+04   10.454196     34044.650812    0.480131    0.500500
min    1.556669e+07   18.000000     15000.000000    0.000000    0.000000
25%    1.562787e+07   30.000000     43000.000000    0.000000    0.000000
50%    1.569440e+07   37.000000     70000.000000    0.000000    0.000000
75%    1.575039e+07   46.000000     88000.000000    1.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000    1.000000

In [5]:
hello.tail()

      User ID  Gender  Age  EstimatedSalary  Purchased  Sex
394  15691863  Female   46            41000          1    0
395  15706071    Male   51            23000          1    1
396  15654296  Female   50            20000          1    0
397  15755018    Male   36            33000          0    1
398  15594041  Female   49            36000          1    0

In [6]:
feature=['User ID','Age','EstimatedSalary','Sex']

In [7]:
X = hello[feature]
y = hello.Purchased

In [8]:
from sklearn.model_selection import train_test_split

In [99]:
X_train, X_test, y_train, y_test = train_test_split(X, y, random_state=1)

In [100]:
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score, recall_score
from sklearn.metrics import confusion_matrix

In [101]:
log_reg=LogisticRegression()
log_reg.fit(X_train,y_train)

LogisticRegression()

In [102]:
y_pred=log_reg.predict(X_test)

In [103]:
accuracy_score(y_test,y_pred)

0.87